<?php

namespace Database\Seeders;
use Illuminate\Support\Facades\DB;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class BlogSeeder extends Seeder
{

    public function run(): void
    {
        DB::table('blogs')->insert([
            [
             'title'=> 'Омега-3 како додаток во исхраната',
             'content' => '<p><span style="color: black;">Омега-3 масните киселини се многу важни за вашето здравје. За нормално функционирање, на телото му се неопходни еден голем спектар на незаситени масни киселини, бидејќи тие се составен дел на мозокот, очите, срцето итн. Во основа омега-3 мастите се клучот за оптимално здравје. Оваа констатација е поради фактот дека човекот не може овие масти да ги произведе сам, а нашето здравје пред се зависи од внесот на омега-3 преку исхраната или&nbsp;</span><strong style="color: black;">суплементи</strong><span style="color: black;">.</span></p><p><span style="color: black;">Континуираното внесување на омега-3 масни киселини позитивно влијае на борбата против слабата меморија, депресијата, слабата циркулација, замор, сува кожа, кардиоваскуларни проблеми и др.</span></p><p><span style="color: black;">Континуираното внесување на омега-3 масни киселини позитивно влијае на борбата против слабата меморија, депресијата, слабата циркулација, замор, сува кожа, кардиоваскуларни проблеми и др.</span></p><p><strong style="color: black;">Доколку сакате добар извор на омега-3 масни киселини препорачуваме:</strong></p><ul><li><strong>Риба </strong>(особено помасните типови риба како лосос, туна, сардини и сл.) и&nbsp;<strong>морските плодови</strong></li><li><strong>јаткасти плодови и семките</strong>&nbsp;(особено оревите, чиа семето и лененото семе)</li><li><strong>растителни масла</strong>&nbsp;– маслиново, ленено и др.</li></ul>',
             'image' => '/img/blog/1743030469_hedra_about_1.jpg',
             'user'=> 'Ивана Димитрова',
             'user_id' => 1,
             'created_at' => now(),
            ],
            [
                'title'=> 'Пролетни алергии',
                'content' => 'Пролетта и алергиите: Како да се заштитите?
                Како што доаѓа пролетта, растенијата почнуваат да цветаат, што предизвикува зголемување на поленот и други алергени во воздухот. Доколку сте подложни на алергии, важно е да ги разберете алергените подобро и да ги истражите стратегиите за минимизирање на вашата изложеност на тие предизвикувачи.

                Што се алергии?
                Алергиските реакции се јавуваат кога вашиот имунолошки систем погрешно ги идентификува безбедните супстанции — како што се прашина, полен или животинска перут — како закани, што доведува до претерана реакција. Овие супстанции се нарекуваат алергени. Најчести пролетни алергени се поленот од дрвјата, тревата и мувлата.

                Поленот, составен од ситни честички кои ги ослободуваат растенијата за време на цветната сезона, е еден од главните предизвикувачи на пролетни алергии. Кај чувствителните лица, вдишувањето на полен го активира имунолошкиот одговор кој резултира со создавање на антитела. Овие антитела го ослободуваат хистаминот и други хемиски соединенија кои ги предизвикуваат симптомите на алергија, како што се чешање, кивање, затнат нос и солзење на очите.',
                'image' => '/img/blog/1743030469_hedra_about_1.jpg',
                'user'=> 'Ивана Димитрова',
                'user_id' => 1,
                'created_at' => now(),
            ],
            [
                'title'=> 'Стресот како дел од секојдневието',
                'content' => '<p><span style="color: rgb(51, 51, 51);">Современото живеење станува сè по исполнето со стрес. Овој стрес произлегува од мноштво извори, вклучувајќи прашања поврзани со работата, предизвиците на воспитувањето деца, финансиски тешкотии и неисполнети аспирации, особено кај помладите генерации како што се студентите. Во суштина, стресот ги пробива сите сегменти на општеството, влијаејќи на сите.</span></p><p><span style="color: rgb(51, 51, 51);">Стресот го претставува одговорот на телото на неповолна ситуација, без разлика дали заканата е вистинска или перципирана. Кога телото ќе почувствува форма на опасност, се активира каскада од биохемиски реакции, првенствено дизајнирани да ја намалат потенцијалната штета. Овој феномен најчесто се нарекува одговор „бори се или бегај“. Во оваа состојба на стрес, отчукувањата на срцето значително се зголемуваат, мускулите стануваат напнати и крвниот притисок се зголемува, подготвувајќи го телото за итна акција или брза реакција.</span></p><p><strong style="color: rgb(51, 51, 51);">Како да го ублажите стресот?</strong></p><p><span style="color: rgb(51, 51, 51);">Намалете го внесот на кофеин, алкохол и енергетски пијалоци.</span></p><p><span style="color: rgb(51, 51, 51);">Слушајте ги звуците на природата.</span></p><p><span style="color: rgb(51, 51, 51);">Обезбедете доволно времетраење и квалитет на спиење.</span></p><p><span style="color: rgb(51, 51, 51);">Вклучете се во социјализација, комуникација и интеракција.</span></p><p><span style="color: rgb(51, 51, 51);">Одвојте време за себе (исклучете се од интернет).</span></p><p><span style="color: rgb(51, 51, 51);">Вклучете смеа и хумор во вашиот живот.</span></p><p><span style="color: rgb(51, 51, 51);">Одржувајте дневник.</span></p><p><span style="color: rgb(51, 51, 51);">Вежбајте да кажувате автентично да и не.</span></p><p><span style="color: rgb(51, 51, 51);">Обезбедете балансиран внес на витамини, особено со голема количина на витамин Ц, </span></p><p><span style="color: rgb(51, 51, 51);">Б витамини, чај од валеријана или маточина, магнезиум и сл.</span></p><p><span style="color: rgb(51, 51, 51);">Размислете да побарате помош од психолог.</span></p>',
                'image' => '/img/blog/1743030469_hedra_about_1.jpg',
                'user'=> 'Ивана Димитрова',
                'user_id' => 1,
                'created_at' => now(),
            ],
        ]);
    }
}
