<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CompanyInfoSeeder extends Seeder
{
    public function run(): void
    {
        DB::table('company_infos')->insert([
            'name' => 'Hedra Farm +',
            'email' => 'pzuhederafarmplus@yahoo.com',
            'phone' => '075 472 123',
            'address' => 'Балканска бр4, Струмица',
            'about' => '<p>Аптекa Хедера фарм плус постои наскоро три години на пазарот- аптеки, со мотото дека грижата на клиентите и нивните потреби е на прво место!</p><p>Стручен совет е суштината на добрата фармацевтска пракса. Работиме со визијата дека здравјето е нашиот најголем подарок, па така ги усовршуваме нашите знаења. Се стремиме да поттикнеме доверба и кредибилитет кон пациентот. Овозможуваме достапност до квалитетни и разновидни лекови, за да може секој пациент да си го добие она што навистина го бара.</p><p>Обезбедуваме&nbsp;разни поволности и промоции кои можете да ги погледнете на овој веб портал.</p><p><br></p><p><strong>Цел</strong></p><p>Давање на стручна и квалитетна фармацевтска грижа за нашите пациенти.</p><p>&nbsp;</p><p><strong>Визија</strong></p><p>Секој наш совет или препорака, да биде корисен!</p><p>&nbsp;</p><p><strong>Мисија</strong></p><p>Навремено снабдување со сите потребни лекови, ОТЦ препарати и козметика. Се трудиме да бидеме во тек со новитетите на пазарот и конкретните потреби на нашите корисници на услуги.</p>'
            ]);
    }
}
