<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
class ProductSeeder extends Seeder
{

    public function run(): void
    {
        DB::table('products')->insert([
            [
                'name' => "Анзибел пастили - мед и лимон",
                'short_description' => "Локално и симптоматско олеснување на благи воспалителни процеси во устата и грлото.",
                'description' => '<p><strong style="color: rgb(20, 22, 23);">Употреба:</strong></p><ul><li><span style="color: rgb(20, 22, 23);">Препорачана доза кај возрасни и деца над 12 години</span></li><li><span style="color: rgb(20, 22, 23);">Една пастила се зема во интервали од 2-3 часа. Максимална дневна доза е 8 пастили.</span></li><li><span style="color: rgb(20, 22, 23);">Препорачана доза кај деца помеѓу 6-12 години</span></li><li><span style="color: rgb(20, 22, 23);">Една пастила се зема во интервали од 4-5 часа. Максимална дневна доза е 6 пастили.</span></li></ul>',
                'price' => 100,
                'quantity' => 10,
                'main_image' => '/assets/products/1743327297_anzibel_pastili.png',
                'is_active' => 1,
                'product_category_id' => 1,
            ],
            [
                'name' => 'Isla Medic Voice пастили за грло',
                'short_description' => 'Isla medic voice пастили за  грло со екстракт од исландски лишај, без шеќер',
                'description' => '<p><span style="color: rgb(68, 68, 68);">Isla Medic Voice се наменети за:</span></p><ul><li><span style="color: rgb(68, 68, 68);">Отстранување на симптоми поврзани со настинка, воспалено грло и засипнатост</span></li><li><span style="color: rgb(68, 68, 68);">Сувост во грлото, воспаление и иритација на гласните жици</span></li></ul><p><span style="color: rgb(68, 68, 68);">Овие симптоми може да се јават како последица на непродуктивна сува кашлица која е резултат на иритирана орална слузница.</span></p><p><strong style="color: rgb(68, 68, 68);">Употреба:</strong></p><p><span style="color: rgb(68, 68, 68);">Возрасни и&nbsp;деца над 6 години: 1 пастила полека да се растопи во уста, по потреба, најмногу 6 пастили дневно.</span></p>',
                'price' => 100,
                'quantity' => 10,
                'main_image' => '/assets/products/1743327688_isla_medic_voice.png',
                'is_active' => 1,
                'product_category_id' => 1,
            ],
            [
                'name' => 'Esi cranberry cist таблети',
                'short_description' => 'За добросостојба на уринарните патишта, против цистит',
                'description' => '<p><span style="color: rgb(32, 36, 53); background-color: rgba(var(--phoenix-white-rgb), var(--phoenix-bg-opacity)); font-weight: var(--phoenix-body-font-weight);">Формулиран за подобрување на физиолошката функција на уринарните патишта. Содржи билни екстракти како што се: брусница, мечкино грозје и семки од грејпфрут: корисни во случаи на проблеми со уринарниот тракт. Мечкиното грозје ја подобрува диурезата. Ортосифон и златица: се билки кои се корисни поради нивното диуретично дејство..</span></p><p><strong style="color: rgb(32, 36, 53);">Употреба:</strong></p><p><span style="color: rgb(32, 36, 53);">Koнсумирање на 2 таблети дневно, со поголема количина вода, за време на оброците.</span></p>',
                'price' => 100,
                'quantity' => 10,
                'main_image' => '/assets/products/1743328343_esi_cranberry_cyst.png',
                'is_active' => 1,
                'product_category_id' => 1,
            ],
            [
                'name' => 'Diastop probio капсули',
                'short_description' => 'Капсулите Диастоп пробио се користат за превенција и за дополнително лекување пролив, надуеност и непријатности кои настануваат поради нарушена рамнотежа на цревната флора.',
                'description' => '<p>Капсулите Диастоп пробио се користат за превенција и за дополнително лекување пролив, надуеност и непријатности кои настануваат поради нарушена рамнотежа на цревната флора.</p><p><strong>Такви состојби се:</strong></p><ul><li>Бактериски, вирусни и цревни инфекции </li><li>Лекување со антибиотици </li></ul><p class="ql-align-justify"><strong>Употреба </strong></p><ul><li class="ql-align-justify">Возрасни: 1-3 капсули дневно.</li><li class="ql-align-justify">Деца над 3 годишна возраст: 1 капсула дневно.</li></ul><p><br></p>',
                'price' => 100,
                'quantity' => 10,
                'main_image' => '/assets/products/1743328748_diastop.png',
                'is_active' => 1,
                'product_category_id' => 1,
            ],
            [
                'name' => 'Stress-gute Nerven таблети',
                'short_description' => 'Овој препарат содржи витамини Б1, Б2, Б6, Б12, ниацин и биотин кои придонесуваат за нормално функционирање на нервниот систем и нормален енергетски метаболизам.',
                'description' => '<p class="ql-align-justify"><span style="color: black;">Овој препарат содржи витамини Б1, Б2, Б6, Б12, ниацин и биотин кои придонесуваат за нормално функционирање на нервниот систем и нормален енергетски метаболизам. Пантотенска киселина (витамин Б5) придонесува за нормални ментални перформанси. Метаболизмот на мозокот и нервите зависи од соодветното снабдување со хранливи материи. Бидејќи нашето тело не може сам да ги произведува овие хранливи материи и не може да ги складира долго, мораме да ги снабдуваме со храна во доволни количини редовно.</span></p><p class="ql-align-justify"><span style="color: black;">Покрај тоа, витаминот Б6, витаминот Б12 и фолната киселина придонесуваат за нормално функционирање на имунолошкиот систем, што може да биде особено предизвик во стресни ситуации. Исто така, содржи 50 mg екстракт од гинко билоба и 40 mg екстракт од лист од маточина.</span></p><p class="ql-align-justify"><strong style="color: black;">УПОТРЕБА:</strong></p><p class="ql-align-justify"><span style="color: black;">Препорачана дневна доза е 1 таблета, со доволно течности.</span></p>',
                'price' => 100,
                'quantity' => 10,
                'main_image' => '/assets/products/1743329188_stress_gute.png',
                'is_active' => 1,
                'product_category_id' => 1,
            ],
            [
                'name' => 'BetaGlucan complex капсули',
                'short_description' => 'Бета Глуканите се молекули кои што природно се создаваат во клеточните ѕидови на одредени житни растенија како што се овесот и јачменот.',
                'description' => '<p>Бета Глуканите се молекули кои што природно се создаваат во клеточните ѕидови на одредени житни растенија како што се овесот и јачменот. Тие се добро познати по нивните својства за зајакнување на имунитетот.</p><p>HealthAid Beta Glucan Complex ги комбинира придобивките од витамините Ц, Д3 и Б12, како и селенот, бакарот, цинкот и фолатот за кои што е познато дека придонесуваат за нормално функционирање на здравиот имунолошки систем.&nbsp;</p><p>Помагаат во превенцијата од малигни заболувања.</p><p>Ја одржуваат благосостојбата на организмот.\</p><p><strong style="color: rgb(20, 22, 23);">Употреба:</strong></p><ul><li>Возрасни и деца над 16 години&nbsp;по една капсула дневно на празен стомак.</li><li>По потреба дозата може да се зголеми на две капсули.</li></ul>',
                'price' => 100,
                'quantity' => 10,
                'main_image' => '/assets/products/1743329539_beta_glucan.png',
                'is_active' => 1,
                'product_category_id' => 2,
            ],
            [
                'name' => 'AlpenFlex Complex таблети',
                'short_description' => 'Комплексот Alpen Flex е избалансирана комбинација од 16 активни состојки за одржување на нормалната функција на зглобовите, коските и ‘рскавицата, подвижноста на зглобовите и одржување на еластичноста на сврзните ткива и тетивите.',
                'description' => '<p><span style="color: black;">Комплексот Alpen Flex е избалансирана комбинација од 16 активни состојки за одржување на нормалната функција на зглобовите, коските и ‘рскавицата, подвижноста на зглобовите</span><strong style="color: black;"> </strong><span style="color: black;">и одржување на еластичноста на сврзните ткива и тетивите. Мулти-комплексната формулација се заснова на принципот на снабдување на телото со важни биоактивни хранливи материи, растителни состојки, витамини и минерали за нормално одржување на коскено-зглобниот систем.</span></p><p><strong style="color: black;">Активни состојки:</strong></p><p><span style="color: black;">Глукозамин сулфат 500 мг, хондроитин сулфат 100 мг, метилсулфонилметан (MSM) 100 мг, колаген 20 мг, хијалуронска киселина 18 мг, екстракт од смола Босвелија 50 мг, Ѓаволски канџи 50 μg, витамин Б20 мг g, витамин Д3 10 µg, витамин Е 12 мг, манган 2 мг, цинк 5 мг, селен 60 мг, бакар 300 мг.</span></p><p><strong style="color: black;">Употреба:</strong></p><p><span style="color: black;">Се препорачува да се зема 1 таблета на ден со чаша вода за време на оброк. За оптимален ефект, земете го производот најмалку 3 месеци.&nbsp;</span></p>',
                'price' => 100,
                'quantity' => 10,
                'main_image' => '/assets/products/1743330134_alpanex.png',
                'is_active' => 1,
                'product_category_id' => 2,
            ],
            [
                'name' => 'AlpenFlex Complex таблети',
                'short_description' => 'Holestop додаток во исхрана, помага во одржување на нормалното ниво на липиди во крвта и регулација на нормалното ниво на холестерол.',
                'description' => '<p><span style="color: rgb(20, 22, 23);">Holestop додаток во исхрана, помага во одржување на нормалното ниво на липиди во крвта и </span><span style="color: black;">регулација на нормалното ниво на холестерол.</span></p><p><span style="color: black;">Во 2 капсули содржи:</span></p><ul><li><span style="color: black;">Екстракт од артичока = 400mg</span></li><li><span style="color: black;">Екстракт од маслинки&nbsp;= 200mg</span></li><li><span style="color: black;">Хидрокситирозол = 6mg</span></li><li><span style="color: black;">Екстракт од лук без мирис = 100mg</span></li><li><span style="color: black;">Ализин = 1mg</span></li><li><span style="color: black;">Црвен ориз = 130mg</span></li><li><span style="color: black;">Монаколин К = 3.9mg</span></li></ul>',
                'price' => 100,
                'quantity' => 10,
                'main_image' => '/assets/products/1743330577_holestop.png',
                'is_active' => 1,
                'product_category_id' => 2,
            ],
            [
                'name' => 'Ferozomal ќеси',
                'short_description' => 'Ќеси за директна примена, со вкус на лимон и шумско овошје.',
                'description' => '<p>ФЕРОЗОМАЛ го обезбедуваат потребното количество железо, со цел да се задоволат зголемените потреби на организмот.</p><p>Една кесичка ФЕРОЗОМАЛ содржи 30 мг железо (во форма на железо-пирофосфат), 80 мг витамин Ц и 2.5 мкг витамин Б12.</p><p>Железото се наоѓа во форма на липозомален комплекс, односно не доаѓа во директен контакт со слузницата на дигестивниот тракт. На тој начин се обезбедува висока биорасположливост, железото добро се поднесува, без мачнини, без стомачни тешкотии, без метален вкус во устата.</p><p><strong>Употреба:&nbsp;</strong></p><p>еднаш&nbsp;дневно, по една кесичка. Треба да се растопи директно во устата.</p>',
                'price' => 100,
                'quantity' => 10,
                'main_image' => '/assets/products/1743332246_ferozomal.png',
                'is_active' => 1,
                'product_category_id' => 2,
            ],
            [
                'name' => 'Liverel таблети',
                'short_description' => 'Првиот и единствен додаток кој комбинира екстрактот од артичока со N-ацетилцистеин, холин, Л-карнитин и Л-глутатион, витамини и минерали.',
                'description' => '<p><span style="color: black;">Првиот и единствен додаток кој комбинира екстрактот од артичока со N-ацетилцистеин, холин, Л-карнитин и Л-глутатион, витамини и минерали.</span></p><p><span style="color: black;">Liverel таблетите содржат избалансирано, мултивитаминско умерено ниво на растителна и минерална формулација, со екстракт од артичок и холин кои придонесуваат за одржување на нормалната здравствена состојба на црниот дроб и одржување на нормална функција на црниот дроб. Liverel ви дава разумно избалансирана мешавина на витамини и минерали во трагови за да го заштитите вашиот дневен внес на клучните хранливи материи и аминокиселини.&nbsp;</span></p><p><span style="color: black;">Liverel е развиен за да помогне на следниве начини:</span></p><ul><li><span style="color: black;">Нормална функција на црниот дроб,</span></li><li><span style="color: black;">Заштита на клетките</span></li></ul><p><br></p>',
                'price' => 100,
                'quantity' => 10,
                'main_image' => '/assets/products/1743332858_liverel.png',
                'is_active' => 1,
                'product_category_id' => 2,
            ],
        ]);
    }
}
